SisCafApi/app/Models/ClienteModel.php

SELECT *
FROM `clientes`
WHERE `telefono` = '6221234567'
AND `contrasena` = 'asdasd'
OR `correo` = '6221234567'
OR `contrasena` = 'asdasd'
 LIMIT 1
---
    public function login($user, $password){
        $result = $this->asArray()->
            where([
                "telefono"=>$user,
                "contrasena"=>$password
            ]) ->orWhere([
                "correo"=>$user,
                "contrasena"=>$password
            ])->first();