SisCafApi/app/Controllers/Auth.php

    public function verifyToken(){
        $key = Services::getSecretKey();
        $token_str = $this->request->getHeader("token")->getValue();

        try {
            $token = JWT::decode($token_str, new key ($key, 'HS256'));
        }catch(\Throwable $th){
            $token= false;
            }

        if(!$token){
            return false;
        }else{
            if($token->data->tipo == "entrenador"){

                $entrenadorModel = new EntrenadorModel();
                $this->entrenador = $entrenadorModel->find($token->data->user_id);
                $this->tipoUsuario ="entrenador";
            }else{
                $clienteModel = new ClienteModel();
                $this->cliente = $clienteModel->find($token->data->user_id);
---
SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '1'