SisCafApi/app/Controllers/Cliente.php

    public function index(){
        /*
        $user=$this->validarEntrenador();
        if(!$user){
            return  $this->respond(["error"=> "usuario o contraseña incorrectos"]);}
            */

        if(!$this->verifyToken()){
            return $this->respond(["error"=> "usuario o contraseña incorrectos"]);
        }

        $data =[
            "clientes"=> $this->model->findAll(),
            "entrenador" => $this->entrenador
        ];
---
SELECT *
FROM `clientes`

    public function show($id=NULL){
        if(!$this->verifyToken()){
            return $this->respond(["error"=> "Token expirado!"]);
        }

        if($this->tipoUsuario == "entrenador" || $this->cliente["id"] == $id){

        } else{
            return $this->respond(["error" => "No tienes permisos para ver esta información"]);
        }

        $data=[
            "cliente" => $this->model->find($id)
        ];
---
SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '1'