SisCafApi/app/Controllers/Dieta.php

SELECT *
FROM `dietas`
WHERE `dietas`.`id` = 2
---
    public function show($id=NULL){
        $data=[
            "dieta" => $this->model->find($id)
        ];