SisCafApi/app/Controllers/Entrenador.php

    public function index(){
        $data =[
            "entrenadores"=> $this->model->FindAll()
        ];
---
SELECT *
FROM `entrenadores`